The two routers R1 and R3 are in separate areas, they connect to the WAN on the 10.x.x.x network.  Ref notes below:

# R1#show ip int brief
# Interface              IP-Address      OK? Method Status                Protocol
# FastEthernet0/0        192.168.10.254  YES manual up                    up
# FastEthernet0/1        10.0.0.1        YES manual up                    up

# R3#show ip int brief
# Interface              IP-Address      OK? Method Status                Protocol
# FastEthernet0/0        10.0.0.6        YES manual up                    up
# FastEthernet0/1        192.168.20.254  YES manual up                    up


Task: create a tunnel on the 192.168.30.0/24 network connecting R1 to R3, start at the lowest host.  Set the source, dest, and mode in that order.

R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int tunnel 0
%LINK-5-CHANGED: Interface Tunnel0, changed state to up
R1(config-if)#ip address 192.168.30.1 255.255.255.0
R1(config-if)#tunnel source f0/1
R1(config-if)#tunnel destination 10.0.0.6
%LINEPROTO-5-UPDOWN: Line protocol on Interface Tunnel0, changed state to up
R1(config-if)#tunnel mode gre ip
R1(config-if)#exit
R1(config)#exit

Complete: tunnel done, but it still won't route yet, as this router doesn't know how to reach it.

Task: Add a static route to the R3's .20.0/24 network, going over the tunnel.

R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip route 192.168.20.0 255.255.255.0 192.168.30.2
R1(config)#exit

Complete: routing is done!

Task: check the routing table, and then show the interfaces (brief).

R1#show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
...

Gateway of last resort is 0.0.0.0 to network 0.0.0.0

     10.0.0.0/30 is subnetted, 1 subnets
C       10.0.0.0 is directly connected, FastEthernet0/1
C    192.168.10.0/24 is directly connected, FastEthernet0/0
S    192.168.20.0/24 [1/0] via 192.168.30.2
C    192.168.30.0/24 is directly connected, Tunnel0
S*   0.0.0.0/0 is directly connected, FastEthernet0/1

R1#show ip int brief
Interface              IP-Address      OK? Method Status                Protocol
FastEthernet0/0        192.168.10.254  YES manual up                    up
FastEthernet0/1        10.0.0.1        YES manual up                    up
Tunnel0                192.168.30.1    YES manual up                    up
Vlan1                  unassigned      YES unset  administratively down down

Note: the other router is similar:

# R3(config)#int tunnel 0
# %LINK-5-CHANGED: Interface Tunnel0, changed state to up
# R3(config-if)#ip address 192.168.30.2 255.255.255.0
# R3(config-if)#tunnel source f0/0
# R3(config-if)#tunnel destination 10.0.0.1
# %LINEPROTO-5-UPDOWN: Line protocol on Interface Tunnel0, changed state to up
# R3(config-if)#tunnel mode gre ip
# R3(config-if)#exit
# R3(config)#ip route 192.168.10.0 255.255.255.0 192.168.30.1   ! static route
# R3(config)#exit

Complete: all done!  Can ping!!!