Objective: set up an L3 switch!  Computers 192.168.10.1 and .20.1 are connected to f0/1 and f0/2, and should be in vlan 10 and 20 respectively.  The switch is a 3560 multilayer.  Config that so that the machines in the different VLANs can ping.

Task: set up the VLANs and add ports.  Create VLAN 10, named A, and set f0/1 to use that VLAN.

SW(config)#vlan 10
SW(config-vlan)#name A
SW(config-vlan)#exit
SW(config)#int f0/1
SW(config-if)#switchport mode access
SW(config-if)#switchport access vlan 10
SW(config-if)#exit

Complete: Good.  The other VLAN is similar:

# SW(config)#vlan 20
# SW(config-vlan)#name B
# SW(config-vlan)#exit
# SW(config)#int f0/2
# SW(config-if)#switchport mode access
# SW(config-if)#switchport access vlan 20
# SW(config-if)#exit


Task: set up inter-VLAN routing.

SW(config)#ip routing
SW(config)#int vlan 10
%LINK-5-CHANGED: Interface Vlan10, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up
SW(config-if)#ip address 192.168.10.254 255.255.255.0
SW(config-if)#exit
SW(config)#int vlan 20
%LINK-5-CHANGED: Interface Vlan20, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up
SW(config-if)#ip address 192.168.20.254 255.255.255.0
SW(config-if)#exit
SW(config)#exit

Complete: Done!